[
  {
    "id": "app-1a2b3c4d",
    "image": "https://i.ibb.co.com/JRgyZGkS/app-1.webp",
    "title": "TaskFlow: AI-Powered Productivity & Task Management Suite",
    "companyName": "Productify Labs",
    "description": "TaskFlow helps you seamlessly organize your work and personal life using AI-powered reminders, smart scheduling, and advanced task tracking. Users can create projects, assign priorities, and visualize deadlines in a clear, intuitive dashboard. AI suggestions help optimize workflows and highlight tasks that need immediate attention. You can collaborate with team members, track progress, and receive personalized productivity insights. Its minimal interface reduces distractions, letting you focus on what truly matters and achieve your goals efficiently.",
    "size": 42,
    "reviews": 8123,
    "ratingAvg": 4.5,
    "downloads": 250000,
    "ratings": [
      { "name": "5 star", "count": 5033 },
      { "name": "4 star", "count": 2200 },
      { "name": "3 star", "count": 560 },
      { "name": "2 star", "count": 210 },
      { "name": "1 star", "count": 120 }
    ]
  },
  {
    "id": "app-2e7f9g0h",
    "image": "https://i.ibb.co.com/4gpK8bYr/app-2.webp",
    "title": "FitPulse: Personalized Fitness Tracker & Wellness Planner",
    "companyName": "HealthMax",
    "description": "FitPulse is your complete health companion, offering personalized workout plans, nutrition tracking, and real-time wellness insights. Users can log exercises, monitor heart rate, and adjust routines according to their fitness goals. The app includes guided workout videos, meal suggestions, and habit tracking to support a sustainable lifestyle. Detailed analytics help track progress, identify trends, and stay motivated. FitPulse combines simplicity and intelligence to make healthy living easy, engaging, and rewarding.",
    "size": 58,
    "reviews": 6400,
    "ratingAvg": 4.3,
    "downloads": 190000,
    "ratings": [
      { "name": "5 star", "count": 3390 },
      { "name": "4 star", "count": 1800 },
      { "name": "3 star", "count": 700 },
      { "name": "2 star", "count": 310 },
      { "name": "1 star", "count": 200 }
    ]
  },
  {
    "id": "app-3k5l8m2n",
    "image": "https://i.ibb.co.com/YFyP9F7y/app-3.webp",
    "title": "NoteNest: Cloud-Synced Notes & Idea Organizer",
    "companyName": "CloudByte",
    "description": "NoteNest provides a seamless note-taking experience with cloud synchronization, rich text editing, and organizational features that let you capture, store, and revisit your thoughts anytime. Users can organize notes into folders, tag ideas, and search across content instantly. Collaboration features allow sharing notes and ideas with colleagues or friends in real-time. Daily reminders help maintain consistency and productivity. The app balances simplicity with powerful functionality, helping you stay creative, organized, and focused on your ideas.",
    "size": 37,
    "reviews": 5230,
    "ratingAvg": 4.6,
    "downloads": 120000,
    "ratings": [
      { "name": "5 star", "count": 2940 },
      { "name": "4 star", "count": 1600 },
      { "name": "3 star", "count": 420 },
      { "name": "2 star", "count": 180 },
      { "name": "1 star", "count": 90 }
    ]
  },
  {
    "id": "app-4p9q6r1s",
    "image": "https://i.ibb.co.com/0pVj35Cj/app-4.webp",
    "title": "QuickBudget: Smart Expense Tracker & Financial Planner",
    "companyName": "Finwise",
    "description": "QuickBudget helps users manage finances effortlessly by tracking expenses, monitoring savings, and setting financial goals. Users can categorize transactions, set monthly budgets, and visualize spending trends through interactive charts. The app provides notifications for upcoming bills, overspending, and opportunities to save. Detailed analytics offer insights into spending habits and areas for improvement. Its intuitive interface and actionable advice make financial planning easy and stress-free for everyone.",
    "size": 48,
    "reviews": 4120,
    "ratingAvg": 4.1,
    "downloads": 96000,
    "ratings": [
      { "name": "5 star", "count": 1090 },
      { "name": "4 star", "count": 1500 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 400 },
      { "name": "1 star", "count": 230 }
    ]
  },
  {
    "id": "app-5u2v7w8x",
    "image": "https://i.ibb.co.com/R4Pm9NQy/app-5.webp",
    "title": "PhotoZen: Advanced AI-Powered Photo Editor & Designer",
    "companyName": "PixelCraft",
    "description": "PhotoZen delivers professional photo editing capabilities using advanced AI for background removal, retouching, and creative design. Users can apply filters, adjust lighting, and enhance images effortlessly with intuitive tools. Templates and AI suggestions streamline complex edits, making high-quality results accessible for beginners and pros alike. The app supports batch editing, real-time previews, and sharing. PhotoZen turns photo editing into a smooth, creative, and enjoyable process for all skill levels.",
    "size": 76,
    "reviews": 9800,
    "ratingAvg": 4.7,
    "downloads": 340000,
    "ratings": [
      { "name": "5 star", "count": 6230 },
      { "name": "4 star", "count": 2100 },
      { "name": "3 star", "count": 750 },
      { "name": "2 star", "count": 420 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": "app-6y1z4a3b",
    "image": "https://i.ibb.co.com/bM1kV1PS/app-6.webp",
    "title": "TravelMate: Trip Planner, Hotel Booking & Local Explorer",
    "companyName": "SkyHop",
    "description": "TravelMate is your ultimate travel companion, helping you plan trips, book hotels, and explore local attractions seamlessly. Users can create itineraries, discover hidden gems, and access real-time travel updates. Integrated maps and navigation features simplify moving around new cities. The app also offers recommendations for dining, entertainment, and activities tailored to your preferences. TravelMate makes traveling stress-free, enjoyable, and memorable by putting all tools in one intuitive interface.",
    "size": 64,
    "reviews": 7320,
    "ratingAvg": 4.2,
    "downloads": 210000,
    "ratings": [
      { "name": "5 star", "count": 3560 },
      { "name": "4 star", "count": 2300 },
      { "name": "3 star", "count": 940 },
      { "name": "2 star", "count": 330 },
      { "name": "1 star", "count": 190 }
    ]
  },
  {
    "id": "app-7c4d8e9f",
    "image": "https://i.ibb.co.com/JRgyZGkS/app-1.webp",
    "title": "FocusPro: Productivity & Pomodoro Timer with Analytics",
    "companyName": "MindBoost",
    "description": "FocusPro leverages the Pomodoro technique to help users maximize productivity and maintain focus. Instead of a simple timer, it provides an immersive work environment that minimizes distractions and tracks completed sessions. Users can customize work and break intervals and review detailed analytics about focus habits over time. Notifications gently prompt when to pause or resume, ensuring a healthy rhythm. Its calm, minimal design reduces cognitive load and helps you stay entirely focused on tasks that matter most.",
    "size": 33,
    "reviews": 6120,
    "ratingAvg": 4.8,
    "downloads": 185000,
    "ratings": [
      { "name": "5 star", "count": 4000 },
      { "name": "4 star", "count": 1500 },
      { "name": "3 star", "count": 400 },
      { "name": "2 star", "count": 140 },
      { "name": "1 star", "count": 80 }
    ]
  },
  {
    "id": "app-8g3h2i5j",
    "image": "https://i.ibb.co.com/4gpK8bYr/app-2.webp",
    "title": "Readify: Ebooks & Audiobooks Library with Recommendations",
    "companyName": "LitWorks",
    "description": "Readify provides access to thousands of ebooks and audiobooks, with smart recommendations based on reading preferences. Users can download content for offline reading, bookmark passages, and create personalized reading lists. The app also includes audio narration with adjustable speed, sleep timers, and customizable fonts. Its library is constantly updated, helping users discover new titles effortlessly. Readify combines convenience and personalization to enhance every reading experience.",
    "size": 59,
    "reviews": 8450,
    "ratingAvg": 4.4,
    "downloads": 280000,
    "ratings": [
      { "name": "5 star", "count": 4900 },
      { "name": "4 star", "count": 2100 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 350 },
      { "name": "1 star", "count": 200 }
    ]
  },
  {
    "id": "app-9k7l5m4n",
    "image": "https://i.ibb.co.com/YFyP9F7y/app-3.webp",
    "title": "EduSphere: Interactive Learning Platform for Students & Teachers",
    "companyName": "Learnly",
    "description": "EduSphere offers interactive lessons, quizzes, and collaborative tools for students and teachers to enhance learning outcomes. Users can track progress, earn badges, and participate in group discussions. Teachers can assign tasks, monitor student performance, and provide personalized feedback. The platform combines gamification with intuitive content delivery, keeping learners motivated and engaged. EduSphere makes digital learning accessible, fun, and effective for all age groups.",
    "size": 82,
    "reviews": 11300,
    "ratingAvg": 4.5,
    "downloads": 400000,
    "ratings": [
      { "name": "5 star", "count": 7050 },
      { "name": "4 star", "count": 2600 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 450 },
      { "name": "1 star", "count": 300 }
    ]
  },
  {
    "id": "app-10o1p2q3r",
    "image": "https://i.ibb.co.com/0pVj35Cj/app-4.webp",
    "title": "Calmify: Meditation, Sleep, & Mindfulness Assistant",
    "companyName": "Wellbeing Co.",
    "description": "Calmify helps users reduce stress, improve focus, and sleep better through guided meditation, ambient sounds, and personalized mindfulness plans. Users can track meditation streaks, set reminders, and explore different techniques for relaxation. Sleep tracking and calming exercises promote restorative rest, while stress management tools improve emotional well-being. The app’s soothing interface and gentle notifications make mindfulness an easy daily habit, supporting overall mental health and balance.",
    "size": 69,
    "reviews": 9700,
    "ratingAvg": 4.9,
    "downloads": 380000,
    "ratings": [
      { "name": "5 star", "count": 7350 },
      { "name": "4 star", "count": 1600 },
      { "name": "3 star", "count": 450 },
      { "name": "2 star", "count": 200 },
      { "name": "1 star", "count": 100 }
    ]
  },
  {
    "id": "app-11r4s5t6u",
    "image": "https://i.ibb.co.com/R4Pm9NQy/app-5.webp",
    "title": "ChatLoop: Secure Messaging & Global Communities",
    "companyName": "Comet Labs",
    "description": "ChatLoop provides fast, secure messaging for individuals and communities around the world. Users can join groups, create channels, and share media safely. End-to-end encryption ensures privacy, while notifications keep you updated on conversations. Advanced moderation tools help manage large communities, and interactive features like polls and reactions enhance engagement. ChatLoop blends security with usability to keep communication safe, organized, and fun for everyone.",
    "size": 55,
    "reviews": 8200,
    "ratingAvg": 4.3,
    "downloads": 310000,
    "ratings": [
      { "name": "5 star", "count": 4850 },
      { "name": "4 star", "count": 2100 },
      { "name": "3 star", "count": 700 },
      { "name": "2 star", "count": 350 },
      { "name": "1 star", "count": 200 }
    ]
  },
  {
    "id": "app-12v7w8x9y",
    "image": "https://i.ibb.co.com/bM1kV1PS/app-6.webp",
    "title": "CookMate: Smart Recipe Finder & Step-by-Step Cooking Assistant",
    "companyName": "YumTech",
    "description": "CookMate lets users discover, organize, and cook recipes with ease. Step-by-step instructions, ingredient substitutions, and meal planning tools help simplify cooking. Users can create shopping lists, save favorite recipes, and adjust portion sizes. AI suggestions recommend recipes based on preferences and available ingredients. CookMate combines functionality and inspiration, making cooking enjoyable, efficient, and creative for beginners and experts alike.",
    "size": 74,
    "reviews": 7400,
    "ratingAvg": 4.6,
    "downloads": 220000,
    "ratings": [
      { "name": "5 star", "count": 4510 },
      { "name": "4 star", "count": 1900 },
      { "name": "3 star", "count": 620 },
      { "name": "2 star", "count": 220 },
      { "name": "1 star", "count": 150 }
    ]
  },
  {
    "id": "app-13z1a2b3c",
    "image": "https://i.ibb.co.com/JRgyZGkS/app-1.webp",
    "title": "SafeVault: Secure Password Manager with Autofill & Encryption",
    "companyName": "CyberFort",
    "description": "SafeVault securely stores and manages passwords and sensitive data using advanced encryption. Users can autofill credentials, generate strong passwords, and back up information safely. The app monitors for security breaches, alerts users, and allows safe sharing with trusted contacts. Its intuitive interface simplifies password management, while advanced analytics show usage patterns and potential security risks. SafeVault gives peace of mind by protecting data in a smart, accessible way.",
    "size": 49,
    "reviews": 6900,
    "ratingAvg": 4.8,
    "downloads": 200000,
    "ratings": [
      { "name": "5 star", "count": 4380 },
      { "name": "4 star", "count": 1800 },
      { "name": "3 star", "count": 480 },
      { "name": "2 star", "count": 160 },
      { "name": "1 star", "count": 80 }
    ]
  },
  {
    "id": "app-14d5e6f7g",
    "image": "https://i.ibb.co.com/4gpK8bYr/app-2.webp",
    "title": "MindNotes: Personal Journal with Emotion Tracking & Insights",
    "companyName": "NeuroTech",
    "description": "MindNotes allows users to journal thoughts, emotions, and experiences while tracking moods and behavior patterns over time. Insights and analytics help users reflect, understand emotions, and build healthy habits. Daily prompts, reminders, and personalization features encourage consistency and mindfulness. MindNotes provides a secure and intuitive environment for self-reflection, emotional growth, and enhanced mental well-being.",
    "size": 38,
    "reviews": 4500,
    "ratingAvg": 4.4,
    "downloads": 125000,
    "ratings": [
      { "name": "5 star", "count": 2100 },
      { "name": "4 star", "count": 1500 },
      { "name": "3 star", "count": 600 },
      { "name": "2 star", "count": 200 },
      { "name": "1 star", "count": 100 }
    ]
  },
  {
    "id": "app-15h2i3j4k",
    "image": "https://i.ibb.co.com/YFyP9F7y/app-3.webp",
    "title": "GroovyTunes: Music Streaming with AI-Curated Playlists",
    "companyName": "BeatLabs",
    "description": "GroovyTunes offers streaming music with AI-curated playlists based on user taste and listening habits. Users can download songs for offline listening, create custom playlists, and explore trending tracks. The app recommends new music, provides lyrics, and supports social sharing. Personalized insights show listening patterns and suggest mood-based playlists. GroovyTunes makes music discovery effortless, fun, and tailored to every user’s preferences.",
    "size": 85,
    "reviews": 15400,
    "ratingAvg": 4.7,
    "downloads": 500000,
    "ratings": [
      { "name": "5 star", "count": 9980 },
      { "name": "4 star", "count": 3200 },
      { "name": "3 star", "count": 1100 },
      { "name": "2 star", "count": 620 },
      { "name": "1 star", "count": 500 }
    ]
  },
  {
    "id": "app-16l7m8n9o",
    "image": "https://i.ibb.co.com/0pVj35Cj/app-4.webp",
    "title": "DailyFit: Comprehensive Daily Workout & Diet Tracker",
    "companyName": "WellTrack",
    "description": "DailyFit tracks workouts, diet, and daily health metrics to help users maintain a balanced lifestyle. Users can log exercises, set goals, monitor calorie intake, and get progress insights. Personalized recommendations guide exercise and meal planning, while analytics show trends and achievements. The app encourages consistent habits and supports users in achieving fitness and wellness goals through an easy-to-use and engaging interface.",
    "size": 63,
    "reviews": 9600,
    "ratingAvg": 4.5,
    "downloads": 310000,
    "ratings": [
      { "name": "5 star", "count": 5820 },
      { "name": "4 star", "count": 2300 },
      { "name": "3 star", "count": 850 },
      { "name": "2 star", "count": 380 },
      { "name": "1 star", "count": 250 }
    ]
  },
  {
    "id": "app-17p3q4r5s",
    "image": "https://i.ibb.co.com/R4Pm9NQy/app-5.webp",
    "title": "CodeTrack: Productivity & Time Tracking for Developers",
    "companyName": "DevStudio",
    "description": "CodeTrack helps developers monitor coding time, track productivity, and generate detailed reports. Users can log tasks, analyze workflow efficiency, and set project timelines. The app integrates with tools like Git and Jira to provide comprehensive insights. Visual dashboards highlight time spent on tasks, completed milestones, and areas to optimize. CodeTrack is a powerful assistant to improve focus, efficiency, and team collaboration for development projects.",
    "size": 45,
    "reviews": 4100,
    "ratingAvg": 4.2,
    "downloads": 95000,
    "ratings": [
      { "name": "5 star", "count": 1630 },
      { "name": "4 star", "count": 1500 },
      { "name": "3 star", "count": 500 },
      { "name": "2 star", "count": 270 },
      { "name": "1 star", "count": 200 }
    ]
  },
  {
    "id": "app-18t6u7v8w",
    "image": "https://i.ibb.co.com/bM1kV1PS/app-6.webp",
    "title": "RideEasy: Real-Time Route Tracking & Affordable Ride Finder",
    "companyName": "TransPorter",
    "description": "RideEasy allows users to find affordable rides, track routes in real-time, and compare transport options. Users can schedule trips, estimate fares, and share locations safely. Integrated navigation provides turn-by-turn directions, while historical data helps optimize routes. The app supports multiple vehicle types, ride-sharing options, and offers alerts for traffic delays. RideEasy makes commuting simple, efficient, and cost-effective.",
    "size": 67,
    "reviews": 8700,
    "ratingAvg": 4.3,
    "downloads": 290000,
    "ratings": [
      { "name": "5 star", "count": 4800 },
      { "name": "4 star", "count": 2400 },
      { "name": "3 star", "count": 900 },
      { "name": "2 star", "count": 370 },
      { "name": "1 star", "count": 230 }
    ]
  },
  {
    "id": "app-19x1y2z3a",
    "image": "https://i.ibb.co.com/JRgyZGkS/app-1.webp",
    "title": "PetCare: Health & Diet Tracker for Your Beloved Pets",
    "companyName": "FurFriends",
    "description": "PetCare lets users monitor pets' health, diet, and wellness. Users can track vaccinations, set feeding schedules, and log medical records. Reminders alert owners about medications, vet appointments, and daily care. Nutrition insights help maintain optimal health, while activity tracking ensures pets stay active. PetCare creates a comprehensive, easy-to-use interface for responsible pet ownership, supporting happy and healthy pets.",
    "size": 53,
    "reviews": 5500,
    "ratingAvg": 4.5,
    "downloads": 170000,
    "ratings": [
      { "name": "5 star", "count": 2630 },
      { "name": "4 star", "count": 1900 },
      { "name": "3 star", "count": 620 },
      { "name": "2 star", "count": 230 },
      { "name": "1 star", "count": 120 }
    ]
  },
  {
    "id": "app-20b4c5d6e",
    "image": "https://i.ibb.co.com/4gpK8bYr/app-2.webp",
    "title": "WeatherGo: Live Weather Forecasts with Radar & Alerts",
    "companyName": "SkyTrack",
    "description": "WeatherGo provides accurate weather forecasts, live radar tracking, and alerts for severe conditions. Users can view hourly, daily, and weekly forecasts, customize notifications for weather events, and track multiple locations. Integrated maps show real-time precipitation and temperature changes. WeatherGo helps users plan activities, commute safely, and stay prepared for changing weather, combining reliability and user-friendly design.",
    "size": 47,
    "reviews": 10200,
    "ratingAvg": 4.6,
    "downloads": 330000,
    "ratings": [
      { "name": "5 star", "count": 6510 },
      { "name": "4 star", "count": 2500 },
      { "name": "3 star", "count": 700 },
      { "name": "2 star", "count": 290 },
      { "name": "1 star", "count": 200 }
    ]
  }
]
